{
    "-moz-broken": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-broken",
        "title": ":-moz-broken",
        "summary": "The :-moz-broken CSS pseudo-class is a Mozilla extension that matches elements representing broken image links."
    },
    "-moz-drag-over": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-drag-over",
        "title": ":-moz-drag-over",
        "summary": "The :-moz-drag-over CSS pseudo-class is a Mozilla extension that matches an element when a dragover event is called on it."
    },
    "-moz-first-node": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-first-node",
        "title": ":-moz-first-node",
        "summary": "The :-moz-first-node CSS pseudo-class is a Mozilla extension that represents any element that is the first child node of some other element. It differs from \":first-child\" because it does not match a first-child element with (non-whitespace) text before it."
    },
    "-moz-focusring": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-focusring",
        "title": ":-moz-focusring",
        "summary": "The :-moz-focusring CSS pseudo-class is a Mozilla extension that is similar to the \":focus\" pseudo-class, but it only matches an element if it's currently focused and a focus ring or other indicator should be drawn around it."
    },
    "-moz-handler-blocked": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-handler-blocked",
        "title": ":-moz-handler-blocked",
        "summary": "The :-moz-handler-blocked CSS pseudo-class is a Mozilla extension that matches elements that can't be displayed because their handlers have been blocked."
    },
    "-moz-handler-crashed": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-handler-crashed",
        "title": ":-moz-handler-crashed",
        "summary": "The :-moz-handler-crashed CSS pseudo-class is a Mozilla extension that matches elements that can't be displayed because the plugin responsible for drawing them has crashed."
    },
    "-moz-handler-disabled": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-handler-disabled",
        "title": ":-moz-handler-disabled",
        "summary": "The :-moz-handler-disabled CSS pseudo-class is a Mozilla extension that matches elements that can't be displayed because their handlers have been disabled by the user."
    },
    "-moz-last-node": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-last-node",
        "title": ":-moz-last-node",
        "summary": "The :-moz-last-node CSS pseudo-class is a Mozilla extension that represents any element that is the last child node of some other element. It differs from \":last-child\" because it does not match a last-child element with (non-whitespace) text after it."
    },
    "-moz-list-bullet": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-list-bullet",
        "title": "::-moz-list-bullet",
        "summary": "The ::-moz-list-bullet CSS pseudo-element is a Mozilla extension that represents the marker (typically a bullet) of a list item (<li>) in an unordered list (<ul>)."
    },
    "-moz-list-number": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-list-number",
        "title": "::-moz-list-number",
        "summary": "The ::-moz-list-number CSS pseudo-element is a Mozilla extension that represents the marker (typically a number) of a list item (<li>) in an ordered list (<ol>)."
    },
    "-moz-loading": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-loading",
        "title": ":-moz-loading",
        "summary": "The :-moz-loading CSS pseudo-class is a Mozilla extension that matches elements that can't be displayed because they have not started loading, such as images that haven't started to arrive yet. Note that images that are in the process of loading are not matched by this pseudo-class."
    },
    "-moz-locale-dir(ltr)": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-locale-dir(ltr)",
        "title": ":-moz-locale-dir(ltr)",
        "summary": "The :-moz-locale-dir(ltr) CSS pseudo-class is a Mozilla extension that matches an element if the user interface is being displayed left-to-right. This is determined by the preference intl.uidirection.locale (where locale is the current locale) being set to \"ltr\"."
    },
    "-moz-locale-dir(rtl)": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-locale-dir(rtl)",
        "title": ":-moz-locale-dir(rtl)",
        "summary": "The :-moz-locale-dir(rtl) CSS pseudo-class is a Mozilla extension that matches an element if the user interface is being displayed right-to-left. This is determined by the preference intl.uidirection.locale (where locale is the current locale) being set to \"rtl\"."
    },
    "-moz-only-whitespace": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-only-whitespace",
        "title": ":-moz-only-whitespace",
        "summary": "The :-moz-only-whitespace CSS pseudo-class matches elements that only contain text nodes that only contain whitespace. (This includes elements with empty text nodes and elements with no child nodes.)"
    },
    "-moz-submit-invalid": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-submit-invalid",
        "title": ":-moz-submit-invalid",
        "summary": "The :-moz-submit-invalid CSS pseudo-class is a Mozilla extension that represents any submit <button> on forms whose contents aren't valid based on their validation constraints."
    },
    "-moz-suppressed": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-suppressed",
        "title": ":-moz-suppressed",
        "summary": "The :-moz-suppressed CSS pseudo-class is a Mozilla extension that matches elements representing images that were suppressed because loading images from the specified site has been blocked."
    },
    "-moz-user-disabled": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-user-disabled",
        "title": ":-moz-user-disabled",
        "summary": "The :-moz-user-disabled CSS pseudo-class is a Mozilla extension that matches elements representing images that were not loaded because images have been entirely disabled by the user's preferences."
    },
    "-moz-window-inactive": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-window-inactive",
        "title": ":-moz-window-inactive",
        "summary": "The :-moz-window-inactive CSS pseudo-class is a Mozilla extension that matches any element while it's in an inactive window."
    },
    "active": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:active",
        "title": ":active",
        "summary": "The :active CSS pseudo-class represents an element (such as a button) that is being activated by the user. When using a mouse, \"activation\" typically starts when the user presses down the primary mouse button."
    },
    "any-link": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:any-link",
        "title": ":any-link",
        "summary": "The :any-link CSS pseudo-class selector represents an element that acts as the source anchor of a hyperlink, independent of whether it has been visited. In other words, it matches every <a> or <area> element that has an href attribute. Thus, it matches all elements that match \":link\" or \":visited\"."
    },
    "autofill": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:autofill",
        "title": ":autofill",
        "summary": "The :autofill CSS pseudo-class matches when an <input> element has its value autofilled by the browser. The class stops matching if the user edits the field."
    },
    "blank": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:blank",
        "title": ":blank",
        "summary": "The :blank CSS pseudo-class selects empty user input elements (e.g. <input> or <textarea>)."
    },
    "checked": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:checked",
        "title": ":checked",
        "summary": "The :checked CSS pseudo-class selector represents any radio (<input type=\"radio\">), checkbox (<input type=\"checkbox\">), or option (<option> in a <select>) element that is checked or toggled to an on state."
    },
    "default": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:default",
        "title": ":default",
        "summary": "The :default CSS pseudo-class selects form elements that are the default in a group of related elements."
    },
    "defined": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:defined",
        "title": ":defined",
        "summary": "The :defined CSS pseudo-class represents any element that has been defined. This includes any standard element built in to the browser, and custom elements that have been successfully defined (i.e. with the CustomElementRegistry.define() method)."
    },
    "dir": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:dir",
        "title": ":dir()",
        "summary": "The :dir() CSS pseudo-class matches elements based on the directionality of the text contained in them."
    },
    "disabled": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:disabled",
        "title": ":disabled",
        "summary": "The :disabled CSS pseudo-class represents any disabled element. An element is disabled if it can't be activated (selected, clicked on, typed into, etc.) or accept focus. The element also has an enabled state, in which it can be activated or accept focus."
    },
    "empty": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:empty",
        "title": ":empty",
        "summary": "The :empty CSS pseudo-class represents any element that has no children. Children can be either element nodes or text (including whitespace). Comments, processing instructions, and CSS \"content\" do not affect whether an element is considered empty."
    },
    "enabled": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:enabled",
        "title": ":enabled",
        "summary": "The :enabled CSS pseudo-class represents any enabled element. An element is enabled if it can be activated (selected, clicked on, typed into, etc.) or accept focus. The element also has a disabled state, in which it can't be activated or accept focus."
    },
    "first": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first",
        "title": ":first",
        "summary": "The :first CSS pseudo-class, used with the \"@page\" at-rule, represents the first page of a printed document. (See \":first-child\" for general first element of a node.)"
    },
    "first-child": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first-child",
        "title": ":first-child",
        "summary": "The :first-child CSS pseudo-class represents the first element among a group of sibling elements."
    },
    "first-of-type": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first-of-type",
        "title": ":first-of-type",
        "summary": "The :first-of-type CSS pseudo-class represents the first element of its type among a group of sibling elements."
    },
    "focus": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus",
        "title": ":focus",
        "summary": "The :focus CSS pseudo-class represents an element (such as a form input) that has received focus. It is generally triggered when the user clicks or taps on an element or selects it with the keyboard's <kbd>Tab</kbd> key."
    },
    "focus-visible": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus-visible",
        "title": ":focus-visible",
        "summary": "The :focus-visible pseudo-class applies while an element matches the \":focus\" pseudo-class and the UA (User Agent) determines via heuristics that the focus should be made evident on the element. (Many browsers show a \"focus ring\" by default in this case.)"
    },
    "focus-within": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus-within",
        "title": ":focus-within",
        "summary": "The :focus-within CSS pseudo-class matches an element if the element or any of its descendants are focused. In other words, it represents an element that is itself matched by the \":focus\" pseudo-class or has a descendant that is matched by :focus. (This includes descendants in shadow trees.)"
    },
    "fullscreen": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:fullscreen",
        "title": ":fullscreen",
        "summary": "The :fullscreen CSS pseudo-class matches every element which is currently in fullscreen mode. If multiple elements have been put into fullscreen mode, this selects them all."
    },
    "future": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:future",
        "title": ":future",
        "summary": "The :future CSS pseudo-class selector is a time-dimensional pseudo-class that will match for any element which appears entirely after an element that matches \":current\". For example in a video with captions which are being displayed by WebVTT."
    },
    "has": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:has",
        "title": ":has()",
        "summary": "The :has() CSS pseudo-class represents an element if any of the selectors passed as parameters (relative to the \":scope\" of the given element) match at least one element."
    },
    "host": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:host",
        "title": ":host",
        "summary": "The :host CSS pseudo-class selects the shadow host of the shadow DOM containing the CSS it is used inside — in other words, this allows you to select a custom element from inside its shadow DOM."
    },
    "host-context": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:host-context",
        "title": ":host-context()",
        "summary": "The :host-context() CSS pseudo-class function selects the shadow host of the shadow DOM containing the CSS it is used inside (so you can select a custom element from inside its shadow DOM) — but only if the selector given as the function's parameter matches the shadow host's ancestor(s) in the place it sits inside the DOM hierarchy."
    },
    "host_function": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:host_function",
        "title": ":host()",
        "summary": "The :host() CSS pseudo-class function selects the shadow host of the shadow DOM containing the CSS it is used inside (so you can select a custom element from inside its shadow DOM) — but only if the selector given as the function's parameter matches the shadow host."
    },
    "hover": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:hover",
        "title": ":hover",
        "summary": "The :hover CSS pseudo-class matches when the user interacts with an element with a pointing device, but does not necessarily activate it. It is generally triggered when the user hovers over an element with the cursor (mouse pointer)."
    },
    "in-range": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:in-range",
        "title": ":in-range",
        "summary": "The :in-range CSS pseudo-class represents an <input> element whose current value is within the range limits specified by the \"min\" and \"max\" attributes."
    },
    "indeterminate": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:indeterminate",
        "title": ":indeterminate",
        "summary": "The :indeterminate CSS pseudo-class represents any form element whose state is indeterminate, such as checkboxes which have their HTML indeterminate attribute set to true, radio buttons which are members of a group in which all radio buttons are unchecked, and indeterminate <progress> elements."
    },
    "invalid": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:invalid",
        "title": ":invalid",
        "summary": "The :invalid CSS pseudo-class represents any <form>, <fieldset>, <input> or other <form> element whose contents fail to validate."
    },
    "is": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:is",
        "title": ":is() (:matches(), :any())",
        "summary": "The :is() CSS pseudo-class function takes a selector list as its argument, and selects any element that can be selected by one of the selectors in that list. This is useful for writing large selectors in a more compact form."
    },
    "lang": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:lang",
        "title": ":lang()",
        "summary": "The :lang() CSS pseudo-class matches elements based on the language they are determined to be in."
    },
    "last-child": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:last-child",
        "title": ":last-child",
        "summary": "The :last-child CSS pseudo-class represents the last element among a group of sibling elements."
    },
    "last-of-type": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:last-of-type",
        "title": ":last-of-type",
        "summary": "The :last-of-type CSS pseudo-class represents the last element of its type among a group of sibling elements."
    },
    "left": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:left",
        "title": ":left",
        "summary": "The :left CSS pseudo-class, used with the \"@page\" at-rule, represents all left-hand pages of a printed document."
    },
    "link": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:link",
        "title": ":link",
        "summary": "The :link CSS pseudo-class represents an element that has not yet been visited. It matches every unvisited <a> or <area> element that has an href attribute."
    },
    "local-link": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:local-link",
        "title": ":local-link",
        "summary": "The :local-link CSS pseudo-class represents a link to the same document. Therefore an element that is the source anchor of a hyperlink whose target's absolute URL matches the element's own document URL."
    },
    "not": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:not",
        "title": ":not()",
        "summary": "The :not() CSS pseudo-class represents elements that do not match a list of selectors. Since it prevents specific items from being selected, it is known as the negation pseudo-class."
    },
    "nth-child": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-child",
        "title": ":nth-child()",
        "summary": "The :nth-child() CSS pseudo-class matches elements based on their position among a group of siblings."
    },
    "nth-col": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-col",
        "title": ":nth-col",
        "summary": "The :nth-col() CSS pseudo-class is designed for tables and grids. It accepts the An+B notation such as used with the \":nth-child\" selector, using this to target every nth column. The values odd and even are also valid."
    },
    "nth-last-child": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-child",
        "title": ":nth-last-child()",
        "summary": "The :nth-last-child() CSS pseudo-class matches elements based on their position among a group of siblings, counting from the end."
    },
    "nth-last-col": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-col",
        "title": ":nth-last-col",
        "summary": "The :nth-last-col() CSS pseudo-class is designed for tables and grids. It accepts the An+B notation such as used with the \":nth-child\" selector, using this to target every nth column before it, therefore counting back from the end of the set of columns. The values odd and even are also valid."
    },
    "nth-last-of-type": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-of-type",
        "title": ":nth-last-of-type()",
        "summary": "The :nth-last-of-type() CSS pseudo-class matches elements based on their position among siblings of the same type (tag name), counting from the end."
    },
    "nth-of-type": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-of-type",
        "title": ":nth-of-type()",
        "summary": "The :nth-of-type() CSS pseudo-class matches elements based on their position among siblings of the same type (tag name)."
    },
    "only-child": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:only-child",
        "title": ":only-child",
        "summary": "The :only-child CSS pseudo-class represents an element without any siblings. This is the same as :first-child:last-child or :nth-child(1):nth-last-child(1), but with a lower specificity."
    },
    "only-of-type": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:only-of-type",
        "title": ":only-of-type",
        "summary": "The :only-of-type CSS pseudo-class represents an element that has no siblings of the same type."
    },
    "optional": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:optional",
        "title": ":optional",
        "summary": "The :optional CSS pseudo-class represents any <input>, <select>, or <textarea> element that does not have the \"required\" attribute set on it."
    },
    "out-of-range": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:out-of-range",
        "title": ":out-of-range",
        "summary": "The :out-of-range CSS pseudo-class represents an <input> element whose current value is outside the range limits specified by the \"min\" and \"max\" attributes."
    },
    "past": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:past",
        "title": ":past",
        "summary": "The :past CSS pseudo-class selector is a time-dimensional pseudo-class that will match for any element which appears entirely before an element that matches \":current\". For example in a video with captions which are being displayed by WebVTT."
    },
    "paused": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:paused",
        "title": ":paused",
        "summary": "The :paused CSS pseudo-class selector is a resource state pseudo-class that will match an audio, video, or similar resource that is capable of being \"played\" or \"paused\", when that element is \"paused\"."
    },
    "picture-in-picture": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:picture-in-picture",
        "title": ":picture-in-picture",
        "summary": "The :picture-in-picture CSS pseudo-class matches the element which is currently in picture-in-picture mode."
    },
    "placeholder-shown": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:placeholder-shown",
        "title": ":placeholder-shown",
        "summary": "The :placeholder-shown CSS pseudo-class represents any <input> or <textarea> element that is currently displaying placeholder text."
    },
    "playing": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:playing",
        "title": ":playing",
        "summary": "The :playing CSS pseudo-class selector is a resource state pseudo-class that will match an audio, video, or similar resource that is capable of being \"played\" or \"paused\", when that element is \"playing\"."
    },
    "read-only": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:read-only",
        "title": ":read-only",
        "summary": "The :read-only CSS pseudo-class represents an element (such as input or textarea) that is not editable by the user."
    },
    "read-write": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:read-write",
        "title": ":read-write",
        "summary": "The :read-write CSS pseudo-class represents an element (such as input or textarea) that is editable by the user."
    },
    "required": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:required",
        "title": ":required",
        "summary": "The :required CSS pseudo-class represents any <input>, <select>, or <textarea> element that has the \"required\" attribute set on it."
    },
    "right": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:right",
        "title": ":right",
        "summary": "The :right CSS pseudo-class, used with the \"@page\" at-rule, represents all right-hand pages of a printed document."
    },
    "root": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:root",
        "title": ":root",
        "summary": "The :root CSS pseudo-class matches the root element of a tree representing the document. In HTML, :root represents the <html> element and is identical to the selector html, except that its specificity is higher."
    },
    "scope": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:scope",
        "title": ":scope",
        "summary": "The :scope CSS pseudo-class represents elements that are a reference point for selectors to match against."
    },
    "target": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:target",
        "title": ":target",
        "summary": "The :target CSS pseudo-class represents a unique element (the target element) with an \"id\" matching the URL's fragment."
    },
    "target-within": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:target-within",
        "title": ":target-within",
        "summary": "The :target-within CSS pseudo-class represents an element that is a target element or contains an element that is a target. A target element is a unique element with an id matching the URL's fragment. In other words, it represents an element that is itself matched by the \":target\" pseudo-class or has a descendant that is matched by :target. (This includes descendants in shadow trees.)"
    },
    "user-invalid": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:user-invalid",
        "title": ":user-invalid (:-moz-ui-invalid)",
        "summary": "The :user-invalid CSS pseudo-class represents any validated form element whose value isn't valid based on their validation constraints, after the user has interacted with it."
    },
    "user-valid": {
        "url": "https://developer.mozilla.org/en-US/docs/web/css/:user-valid",
        "title": ":user-valid (:-moz-ui-valid)",
        "summary": "The :user-valid CSS pseudo-class represents any validated form element whose value validates correctly based on its validation constraints. However, unlike \":valid\" it only matches once the user has interacted with it."
    },
    "valid": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:valid",
        "title": ":valid",
        "summary": "The :valid CSS pseudo-class represents any <input> or other <form> element whose contents validate successfully. This allows to easily make valid fields adopt an appearance that helps the user confirm that their data is formatted properly."
    },
    "visited": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:visited",
        "title": ":visited",
        "summary": "The :visited CSS pseudo-class represents links that the user has already visited. For privacy reasons, the styles that can be modified using this selector are very limited."
    },
    "where": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:where",
        "title": ":where()",
        "summary": "The :where() CSS pseudo-class function takes a selector list as its argument, and selects any element that can be selected by one of the selectors in that list."
    },
    "-moz-color-swatch": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-color-swatch",
        "title": "::-moz-color-swatch",
        "summary": "The ::-moz-color-swatch CSS pseudo-element is a Mozilla extension that represents the color selected in an <input> of type=\"color\"."
    },
    "-moz-focus-inner": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-focus-inner",
        "title": "::-moz-focus-inner",
        "summary": "The ::-moz-focus-inner CSS pseudo-element is a Mozilla extension that represents an inner focus ring of the <button> element as well as the <button>, <submit>, <reset>, and <color> types of the <input> element."
    },
    "-moz-page": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-page",
        "title": "::-moz-page",
        "summary": "The ::-moz-page CSS pseudo-element is a Mozilla extension that represents an individual page when printed or in a print preview."
    },
    "-moz-page-sequence": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-page-sequence",
        "title": "::-moz-page-sequence",
        "summary": "The ::-moz-page-sequence CSS pseudo-element is a Mozilla extension that represents the background of a print preview."
    },
    "-moz-progress-bar": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-progress-bar",
        "title": "::-moz-progress-bar",
        "summary": "The ::-moz-progress-bar CSS pseudo-element is a Mozilla extension that represents the progress bar inside a <progress> element. (The bar represents the amount of progress that has been made.)"
    },
    "-moz-range-progress": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-range-progress",
        "title": "::-moz-range-progress",
        "summary": "The ::-moz-range-progress CSS pseudo-element is a Mozilla extension that represents the lower portion of the track (i.e., groove) in which the indicator slides in an <input> of type=\"range\". This portion corresponds to values lower than the value currently selected by the thumb (i.e., virtual knob)."
    },
    "-moz-range-thumb": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-range-thumb",
        "title": "::-moz-range-thumb",
        "summary": "The ::-moz-range-thumb CSS pseudo-element is a Mozilla extension that represents the thumb (i.e., virtual knob) of an <input> of type=\"range\". The user can move the thumb along the input's track to alter its numerical value."
    },
    "-moz-range-track": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-range-track",
        "title": "::-moz-range-track",
        "summary": "The ::-moz-range-track CSS pseudo-element is a Mozilla extension that represents the track (i.e., groove) in which the indicator slides in an <input> of type=\"range\"."
    },
    "-moz-scrolled-page-sequence": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-moz-scrolled-page-sequence",
        "title": "::-moz-scrolled-page-sequence",
        "summary": "The ::-moz-scrolled-page-sequence CSS pseudo-element is a Mozilla extension that represents the background of a print preview."
    },
    "-webkit-inner-spin-button": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-inner-spin-button",
        "title": "::-webkit-inner-spin-button",
        "summary": "The ::-webkit-inner-spin-button CSS pseudo-element is used to style the inner part of the spinner button of number picker input elements."
    },
    "-webkit-meter-bar": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-meter-bar",
        "title": "::-webkit-meter-bar",
        "summary": "The ::-webkit-meter-bar CSS pseudo-class is a WebKit extension that represents the meter bar in a <meter> element."
    },
    "-webkit-meter-even-less-good-value": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-meter-even-less-good-value",
        "title": "::-webkit-meter-even-less-good-value",
        "summary": "The ::-webkit-meter-even-less-good-value gives a red color to a <meter> element when the value and the optimum attributes fall outside the low-high range, but in opposite zones. To illustrate, it applies when value < low < high < optimum or value > high > low > optimum."
    },
    "-webkit-meter-inner-element": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-meter-inner-element",
        "title": "::-webkit-meter-inner-element",
        "summary": "::-webkit-meter-inner-element is a proprietary WebKit CSS pseudo-element for selecting and applying styles to the outer containing element of a <meter> element. Additional markup to render the meter element as read-only."
    },
    "-webkit-meter-optimum-value": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-meter-optimum-value",
        "title": "::-webkit-meter-optimum-value",
        "summary": "The ::-webkit-meter-optimum-value CSS pseudo-element styles the <meter> element when its value is inside the low-high range."
    },
    "-webkit-meter-suboptimum-value": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-meter-suboptimum-value",
        "title": "::-webkit-meter-suboptimum-value",
        "summary": "The ::-webkit-meter-suboptimum-value pseudo-element gives a yellow color to the <meter> element when the value attribute falls outside of the low-high range."
    },
    "-webkit-outer-spin-button": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-outer-spin-button",
        "title": "::-webkit-outer-spin-button",
        "summary": "The ::-webkit-outer-spin-button CSS pseudo-element is used to style the outer part of the spinner button of number picker <input> elements."
    },
    "-webkit-progress-bar": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-progress-bar",
        "title": "::-webkit-progress-bar",
        "summary": "The ::-webkit-progress-bar CSS pseudo-element represents the entire bar of a <progress> element. Normally it's only visible as the unfilled portion of the bar, since by default it's rendered below the \"::-webkit-progress-value\" pseudo-element. It is a child of the \"::-webkit-progress-inner-element\" pseudo-element and the parent of the \"::-webkit-progress-value\" pseudo-element."
    },
    "-webkit-progress-inner-element": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-progress-inner-element",
        "title": "::-webkit-progress-inner-element",
        "summary": "The ::-webkit-progress-inner-element CSS pseudo-element represents the outermost container of the <progress> element. It is the parent of the \"::-webkit-progress-bar\" pseudo-element."
    },
    "-webkit-progress-value": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-progress-value",
        "title": "::-webkit-progress-value",
        "summary": "The ::-webkit-progress-value CSS pseudo-element represents the filled-in portion of the bar of a <progress> element. It is a child of the \"::-webkit-progress-bar\" pseudo-element."
    },
    "-webkit-scrollbar": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-scrollbar",
        "title": "::-webkit-scrollbar",
        "summary": "The ::-webkit-scrollbar CSS pseudo-element affects the style of an element's scrollbar when it has overflow:scroll; set."
    },
    "-webkit-search-cancel-button": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-search-cancel-button",
        "title": "::-webkit-search-cancel-button",
        "summary": "The ::-webkit-search-cancel-button CSS pseudo-element represents a button (the \"cancel button\") at the edge of an <input> of type=\"search\" which clears away the current value of the <input> element. This button and pseudo-element are non-standard, supported only in WebKit and Blink, hence the vendor prefix. The clear button is only shown on non-empty search <input> elements."
    },
    "-webkit-search-results-button": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-search-results-button",
        "title": "::-webkit-search-results-button",
        "summary": "The ::-webkit-search-results-button CSS pseudo-element represents a button (the \"search results button\") at the left edge of an <input> of type=\"search\" which when clicked displays a menu which allows the user to choose from previous recent search queries. This button and pseudo-element are non-standard, supported only in WebKit and Blink, hence the vendor prefix. The search results button is only shown on search <input> elements that have a results attribute."
    },
    "-webkit-slider-runnable-track": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-slider-runnable-track",
        "title": "::-webkit-slider-runnable-track",
        "summary": "The ::-webkit-slider-runnable-track CSS pseudo-element represents the \"track\" (the groove in which the indicator slides) of an <input type=\"range\">."
    },
    "-webkit-slider-thumb": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::-webkit-slider-thumb",
        "title": "::-webkit-slider-thumb",
        "summary": "The ::-webkit-slider-thumb CSS pseudo-element represents the \"thumb\" that the user can move within the \"groove\" of an <input> of type=\"range\" to alter its numerical value."
    },
    "after": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::after",
        "title": "::after (:after)",
        "summary": "In CSS, ::after creates a pseudo-element that is the last child of the selected element. It is often used to add cosmetic content to an element with the \"content\" property. It is inline by default."
    },
    "backdrop": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::backdrop",
        "title": "::backdrop",
        "summary": "The ::backdrop CSS pseudo-element is a box the size of the viewport which is rendered immediately beneath any element being presented in fullscreen mode. This includes both elements which have been placed in fullscreen mode using the Fullscreen API and <dialog> elements."
    },
    "before": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::before",
        "title": "::before (:before)",
        "summary": "In CSS, ::before creates a pseudo-element that is the first child of the selected element. It is often used to add cosmetic content to an element with the \"content\" property. It is inline by default."
    },
    "cue": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::cue",
        "title": "::cue",
        "summary": "The ::cue CSS pseudo-element matches WebVTT cues within a selected element. This can be used to style captions and other cues in media with VTT tracks."
    },
    "cue-region": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::cue-region",
        "title": "::cue-region",
        "summary": "The ::cue-region CSS pseudo-element matches WebVTT cues within a selected element. This can be used to style captions and other cues in media with VTT tracks."
    },
    "file-selector-button": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::file-selector-button",
        "title": "::file-selector-button",
        "summary": "The ::file-selector-button CSS pseudo-element represents the button of an <input> of type=\"file\"."
    },
    "first-letter": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::first-letter",
        "title": "::first-letter (:first-letter)",
        "summary": "The ::first-letter CSS pseudo-element applies styles to the first letter of the first line of a block-level element, but only when not preceded by other content (such as images or inline tables)."
    },
    "first-line": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::first-line",
        "title": "::first-line (:first-line)",
        "summary": "The ::first-line CSS pseudo-element applies styles to the first line of a block-level element."
    },
    "grammar-error": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::grammar-error",
        "title": "::grammar-error",
        "summary": "The ::grammar-error CSS pseudo-element represents a text segment which the user agent has flagged as grammatically incorrect."
    },
    "marker": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::marker",
        "title": "::marker",
        "summary": "The ::marker CSS pseudo-element selects the marker box of a list item, which typically contains a bullet or number. It works on any element or pseudo-element set to display: list-item, such as the <li> and <summary> elements."
    },
    "part": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::part",
        "title": "::part()",
        "summary": "The ::part CSS pseudo-element represents any element within a shadow tree that has a matching \"part\" attribute."
    },
    "placeholder": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::placeholder",
        "title": "::placeholder",
        "summary": "The ::placeholder CSS pseudo-element represents the placeholder text in an <input> or <textarea> element."
    },
    "selection": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::selection",
        "title": "::selection",
        "summary": "The ::selection CSS pseudo-element applies styles to the part of a document that has been highlighted by the user (such as clicking and dragging the mouse across text)."
    },
    "slotted": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::slotted",
        "title": "::slotted()",
        "summary": "The ::slotted() CSS pseudo-element represents any element that has been placed into a slot inside an HTML template (see Using templates and slots for more information)."
    },
    "spelling-error": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::spelling-error",
        "title": "::spelling-error",
        "summary": "The ::spelling-error CSS pseudo-element represents a text segment which the user agent has flagged as incorrectly spelled."
    },
    "target-text": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::target-text",
        "title": "::target-text",
        "summary": "The ::target-text CSS pseudo-element represents the text that has been scrolled to if the browser supports scroll-to-text fragments. It allows authors to choose how to highlight that section of text."
    }
}
