{
    "accesskey": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/accesskey",
        "title": "accesskey",
        "summary": "The accesskey global attribute provides a hint for generating a keyboard shortcut for the current element. The attribute value must consist of a single printable character (which includes accented and other characters that can be generated by the keyboard)."
    },
    "autocapitalize": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/autocapitalize",
        "title": "autocapitalize",
        "summary": "The autocapitalize global attribute is an enumerated attribute that controls whether and how text input is automatically capitalized as it is entered/edited by the user."
    },
    "autofocus": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/autofocus",
        "title": "autofocus",
        "summary": "The autofocus global attribute is a Boolean attribute indicating that an element should be focused on page load, or when the <dialog> that it is part of is displayed."
    },
    "class": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/class",
        "title": "class",
        "summary": "The class global attribute is a space-separated list of the case-sensitive classes of the element. Classes allow CSS and Javascript to select and access specific elements via the class selectors or functions like the DOM method document.getElementsByClassName."
    },
    "contenteditable": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/contenteditable",
        "title": "contenteditable",
        "summary": "The contenteditable global attribute is an enumerated attribute indicating if the element should be editable by the user. If so, the browser modifies its widget to allow editing."
    },
    "contextmenu": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/contextmenu",
        "title": "contextmenu",
        "summary": "The contextmenu global attribute is the id of a <menu> to use as the contextual menu for this element."
    },
    "data-*": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/data-*",
        "title": "data-*",
        "summary": "The data- global attributes form a class of attributes called custom data attributes, that allow proprietary information to be exchanged between the HTML and its DOM representation by scripts."
    },
    "dir": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/dir",
        "title": "dir",
        "summary": "The dir global attribute is an enumerated attribute that indicates the directionality of the element's text."
    },
    "draggable": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/draggable",
        "title": "draggable",
        "summary": "The draggable global attribute is an enumerated attribute that indicates whether the element can be dragged, either with native browser behavior or the HTML Drag and Drop API."
    },
    "enterkeyhint": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/enterkeyhint",
        "title": "enterkeyhint",
        "summary": "The enterkeyhint global attribute\nis an enumerated attribute defining what action label (or icon) to present for the enter key on virtual keyboards."
    },
    "hidden": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/hidden",
        "title": "hidden",
        "summary": "The hidden global attribute is a Boolean attribute indicating that the element is not yet, or is no longer, relevant. For example, it can be used to hide elements of the page that can't be used until the login process has been completed. Browsers won't render elements with the hidden attribute set."
    },
    "id": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/id",
        "title": "id",
        "summary": "The id global attribute defines an identifier (ID) which must be unique in the whole document. Its purpose is to identify the element when linking (using a fragment identifier), scripting, or styling (with CSS)."
    },
    "inputmode": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/inputmode",
        "title": "inputmode",
        "summary": "The inputmode global attribute is an enumerated attribute that hints at the type of data that might be entered by the user while editing the element or its contents.\nThis allows a browser to display an appropriate virtual keyboard.",
        "values": [
            "none",
            "text",
            "decimal",
            "numeric",
            "tel",
            "search",
            "email",
            "url"
        ]
    },
    "is": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/is",
        "title": "is",
        "summary": "The is global attribute allows you to specify that a standard HTML element should behave like a defined custom built-in element (see Using custom elements for more details)."
    },
    "itemid": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/itemid",
        "title": "itemid",
        "summary": "The itemid global attribute provides microdata in the form of a unique, global identifier of an item."
    },
    "itemprop": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/itemprop",
        "title": "itemprop",
        "summary": "The itemprop global attribute is used to add properties to an item. Every HTML element can have an itemprop attribute specified, and an itemprop consists of a name-value pair. Each name-value pair is called a property, and a group of one or more properties forms an item. Property values are either a string or a URL and can be associated with a very wide range of elements including <audio>, <embed>, <iframe>, <img>, <link>, <object>, <source> , <track>, and <video>."
    },
    "itemref": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/itemref",
        "title": "itemref",
        "summary": "Properties that are not descendants of an element with the \"itemscope\" attribute can be associated with an item using the global attribute itemref."
    },
    "itemscope": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/itemscope",
        "title": "itemscope",
        "summary": "itemscope is a boolean global attribute that defines the scope of associated metadata. Specifying the itemscope attribute for an element creates a new item, which results in a number of name-value pairs that are associated with the element."
    },
    "itemtype": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/itemtype",
        "title": "itemtype",
        "summary": "The global attribute itemtype specifies the URL of the vocabulary that will be used to define itemprop's (item properties) in the data structure."
    },
    "lang": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/lang",
        "title": "lang",
        "summary": "The lang global attribute helps define the language of an element: the language that non-editable elements are written in, or the language that the editable elements should be written in by the user. The attribute contains a single \"language tag\" in the format defined in RFC 5646 (also known as BCP 47)."
    },
    "nonce": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/nonce",
        "title": "nonce",
        "summary": "The nonce global attribute\nis a content attribute defining a cryptographic nonce (\"number used once\") which can be used by\nContent Security Policy to determine whether or not a given fetch will\nbe allowed to proceed for a given element."
    },
    "part": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/part",
        "title": "part",
        "summary": "The part global attribute contains a space-separated list of the part names of the element. Part names allows CSS to select and style specific elements in a shadow tree via the \"::part\" pseudo-element."
    },
    "slot": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/slot",
        "title": "slot",
        "summary": "The slot global attribute assigns a slot in a shadow DOM shadow tree to an element: An element with a slot attribute is assigned to the slot created by the <slot> element whose \"name\" attribute's value matches that slot attribute's value."
    },
    "spellcheck": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/spellcheck",
        "title": "spellcheck",
        "summary": "The spellcheck global attribute is an enumerated attribute defines whether the element may be checked for spelling errors."
    },
    "style": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/style",
        "title": "style",
        "summary": "The style global attribute contains CSS styling declarations to be applied to the element. Note that it is recommended for styles to be defined in a separate file or files. This attribute and the <style> element have mainly the purpose of allowing for quick styling, for example for testing purposes."
    },
    "tabindex": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/tabindex",
        "title": "tabindex",
        "summary": "The tabindex global attribute indicates that its element can be focused, and where it participates in sequential keyboard navigation (usually with the <kbd>Tab</kbd> key, hence the name)."
    },
    "title": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/title",
        "title": "title",
        "summary": "The title global attribute contains text representing advisory information related to the element it belongs to."
    },
    "translate": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/translate",
        "title": "translate",
        "summary": "The translate global attribute is an enumerated attribute that is used to specify whether an element's translatable attribute values and its Text node children should be translated when the page is localized, or whether to leave them unchanged."
    },
    "x-ms-acceleratorkey": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/x-ms-acceleratorkey",
        "title": "x-ms-acceleratorkey",
        "summary": "The x-ms-acceleratorkey attribute accessibly declares that an accelerator key has been assigned to an element: the element is activated via JavaScript when the key(s) are pressed on a keyboard."
    },
    "x-ms-format-detection": {
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/x-ms-format-detection",
        "title": "x-ms-format-detection",
        "summary": "The x-ms-format-detection>) attribute determines whether data formats within the element's text, like phone numbers, are automatically converted to followable links."
    }
}
